andreili/STM32FX_FM/inc/stm32_rcc.hpp
#ifndef __STM32_RCC__
#define __STM32_RCC__

/*
 * Based on HAL v1.21.0(F4), v1.6.1(F1)
 * */

#include <stm32_inc.h>

#define RCC_CIR_OFFSET                   0x0c

namespace STM32
{

class RCC
{
public:
    enum class EFlag: uint8_t
    {
        MASK                    = 0x1FU,
        /* Flags in the CR register */
        HSIRDY                  = 0x21U,
        HSERDY                  = 0x31U,
        PLLRDY                  = 0x39U,
        PLLI2SRDY               = 0x3BU,
        /* Flags in the BDCR register */
        LSERDY                  = 0x41U,
        /* Flags in the CSR register */
        LSIRDY                  = 0x61U,
        BORRST                  = 0x79U,
        PINRST                  = 0x7AU,
        PORRST                  = 0x7BU,
        SFTRST                  = 0x7CU,
        IWDGRST                 = 0x7DU,
        WWDGRST                 = 0x7EU,
        LPWRRST                 = 0x7FU,
    };

    enum class EHSEState: uint8_t
    {
        ON,
        BYPASS,
        OFF,
    };

    enum class ELSEState: uint8_t
    {
        ON,
        BYPASS,
        OFF,
    };

    enum class EIT: uint32_t
    {
        LSIRDY                  = 0x01U,
        LSERDY                  = 0x02U,
        HSIRDY                  = 0x04U,
        HSERDY                  = 0x08U,
        PLLRDY                  = 0x10U,
        PLLI2SRDY               = 0x20U,
        CSS                     = 0x80U,
    };

    enum class EPLL: uint8_t
    {
        NONE,
        OFF,
        ON,
    };

    enum class EPLLP: uint32_t
    {
        DIV2                    = 0x0,
        DIV4                    = 0x1,
        DIV6                    = 0x2,
        DIV8                    = 0x3,
    };

    enum class EPLLSource: uint32_t
    {
        HSI = 0x0,
        HSE = 0x1,
    };

    enum EClockType: uint32_t
    {
        SYSCLK                  = 0x00000001U,
        HCLK                    = 0x00000002U,
        PCLK1                   = 0x00000004U,
        PCLK2                   = 0x00000008U,
    };

    enum class EAHBDivider: uint32_t
    {
        _1   = 0x0,
        _2   = 0x8,
        _4   = 0x9,
        _8   = 0xA,
        _16  = 0xB,
        _32  = 0xC,
        _64  = 0xD,
        _128 = 0xE,
        _256 = 0xF,
    };

    enum class EAPBDivider: uint32_t
    {
        _1   = 0x0,
        _2   = 0x4,
        _4   = 0x5,
        _8   = 0x6,
        _16  = 0x7,
    };

    enum class EMCODivider: uint32_t
    {
        _1   = 0x0,
        _2   = 0x4,
        _3   = 0x5,
        _4   = 0x6,
        _5   = 0x7,
    };

    enum class EMCO1Source: uint32_t
    {
        HSI  = 0x0,
        LSE  = 0x1,
        HSE  = 0x2,
        PLL  = 0x3,
    };

    enum class EMCO2Source: uint32_t
    {
        SYSCLK  = 0x0,
        PLLI2S  = 0x1,
        HSE     = 0x2,
        PLL     = 0x3,
    };

    enum class ESystemClock: uint32_t
    {
        HSI  = 0x0,
        HSE  = 0x1,
        PLL  = 0x2,
        NA   = 0x3,
    };

    enum class EI2SSource: uint32_t
    {
        PLLI2S   = 0x0,
        I2S_CKIN = 0x1,
    };

    enum class EPeriphHCLK: uint32_t
    {
    #if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx)
        I2S        = 0x01,
        SAI_PLLI2S = 0x02,
        SAI_PLLSAI = 0x04,
        LTDC       = 0x08,
        TIM        = 0x10,
        RTC        = 0x20,
        PLLI2S     = 0x40,
    #endif
    #if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx)|| defined(STM32F417xx) ||\
        defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
        I2S        = 0x01,
        RTC        = 0x02,
        PLLI2S     = 0x04,
    #endif /* STM32F405xx || STM32F415xx || STM32F407xx || STM32F417xx || STM32F401xC || STM32F401xE || STM32F411xE */
    #if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
        RTC        = 0x08,
    #endif
    };
    friend EPeriphHCLK operator&(const EPeriphHCLK v1, const EPeriphHCLK v2)
    {
        return EPeriphHCLK(uint32_t(v1) & uint32_t(v2));
    }

    #if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F446xx) ||\
        defined(STM32F469xx) || defined(STM32F479xx)
    enum class EPLLSAIDiv: uint32_t
    {
        R_2  = 0,
        R_4  = 1,
        R_8  = 2,
        R_16 = 3,
    }
    #endif

    #if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
    #define RCC_SAIACLKSOURCE_PLLSAI        ((uint32_t)0x00000000U)
    #define RCC_SAIACLKSOURCE_PLLI2S        ((uint32_t)0x00100000U)
    #define RCC_SAIACLKSOURCE_EXT           ((uint32_t)0x00200000U)

    #define RCC_SAIBCLKSOURCE_PLLSAI        ((uint32_t)0x00000000U)
    #define RCC_SAIBCLKSOURCE_PLLI2S        ((uint32_t)0x00400000U)
    #define RCC_SAIBCLKSOURCE_EXT           ((uint32_t)0x00800000U)
    #endif

    typedef struct
    {
        EPeriphHCLK selector;
        uint32_t    PLLI2S;
        uint32_t    RTC_div;
        uint32_t    RTC_src;
    #if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
     || defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
        uint32_t    TIMPresSelection;
    #endif
    #if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
        uint32_t    PLLSAI;
        uint32_t    PLLI2SDivQ;
        uint32_t    PLLSAIDivQ;
        uint32_t    PLLSAIDivR;
    #if defined(STM32F469xx) || defined(STM32F479xx)
        uint32_t    Clk48ClockSelection;
        uint32_t    SdioClockSelection;
    #endif
    #endif

    #if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
        uint32_t    PLLSAIN;
    #if defined(STM32F469xx) || defined(STM32F479xx)
        uint32_t    PLLSAIP;
    #endif
        uint32_t    PLLSAIQ;
        uint32_t    PLLSAIR;
    #endif

    #if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
        uint32_t    PLLI2SQ;
    #endif
        uint32_t    PLLI2SN;
        uint32_t    PLLI2SR;
    } RCC_Periph_Clock_Source;

