andreili/STM32FX_FM/inc/stm32_rcc.hpp
    static void init();
    static void deinit_cold();
    static uint32_t deinit();
    static void deinit_per();

    static inline void HSI_enable() { STM32_REGS::RCC::CR::set_flags<STM32_REGS::RCC::CR::EMasks::HSION>(); }
    static inline void HSI_disable() { STM32_REGS::RCC::CR::clear_flags<STM32_REGS::RCC::CR::EMasks::HSION>(); }
    static inline void set_calibration_value_HSI(uint32_t value) { STM32_REGS::RCC::CR::set_HSITRIM(value); }
    static inline bool HSI_ready() { return STM32_REGS::RCC::CR::get_flags<STM32_REGS::RCC::CR::EMasks::HSIRDY>(); }

    static inline void LSI_enable() { STM32_REGS::RCC::CSR::set_flags<STM32_REGS::RCC::CSR::EMasks::LSION>(); }
    static inline void LSI_disable() { STM32_REGS::RCC::CSR::clear_flags<STM32_REGS::RCC::CSR::EMasks::LSION>(); }

    static inline void HSE_enable() { STM32_REGS::RCC::CR::set_flags<STM32_REGS::RCC::CR::EMasks::HSEON>(); }
    static inline void HSE_disable() { STM32_REGS::RCC::CR::clear_flags<STM32_REGS::RCC::CR::EMasks::HSEON, STM32_REGS::RCC::CR::EMasks::HSEBYP>(); }
    static inline void HSE_BYPASS_enable() { STM32_REGS::RCC::CR::set_flags<STM32_REGS::RCC::CR::EMasks::HSEON, STM32_REGS::RCC::CR::EMasks::HSEBYP>(); }
    static inline void HSE_BYPASS_disable() { STM32_REGS::RCC::CR::clear_flags<STM32_REGS::RCC::CR::EMasks::HSEON, STM32_REGS::RCC::CR::EMasks::HSEBYP>(); }
    static inline bool HSE_ready() { return STM32_REGS::RCC::CR::get_flags<STM32_REGS::RCC::CR::EMasks::HSERDY>(); }
    static void config_HSE(EHSEState state);

    static inline void LSE_enable() { STM32_REGS::RCC::BDCR::set_flags<STM32_REGS::RCC::BDCR::EMasks::LSEON>(); }
    static inline void LSE_disable() { STM32_REGS::RCC::BDCR::clear_flags<STM32_REGS::RCC::BDCR::EMasks::LSEON,
                STM32_REGS::RCC::BDCR::EMasks::LSEBYP>(); }
    static inline bool LSE_enabled() { return STM32_REGS::RCC::BDCR::get_flags<STM32_REGS::RCC::BDCR::EMasks::LSEON>(); }
    static inline bool LSE_ready() { return STM32_REGS::RCC::BDCR::get_flags<STM32_REGS::RCC::BDCR::EMasks::LSERDY>(); }
    static inline void LSE_BP_enable() { STM32_REGS::RCC::BDCR::set_flags<STM32_REGS::RCC::BDCR::EMasks::LSEBYP>(); }
    static inline void LSE_BP_disable() { STM32_REGS::RCC::BDCR::clear_flags<STM32_REGS::RCC::BDCR::EMasks::LSEBYP>(); }
    static void config_LSE(ELSEState state);

    static inline void RTC_enable() { STM32_REGS::RCC::BDCR::set_flags<STM32_REGS::RCC::BDCR::EMasks::RTCEN>(); }
    static inline void RTC_disable() { STM32_REGS::RCC::BDCR::clear_flags<STM32_REGS::RCC::BDCR::EMasks::RTCEN>(); }
    static inline bool RTC_enabled() { return STM32_REGS::RCC::BDCR::get_flags<STM32_REGS::RCC::BDCR::EMasks::RTCEN>(); }
    #ifdef STM32F4
    static void set_prescaler_RTC(uint32_t value);
    static inline uint32_t get_prescaler_RTC() { return STM32_REGS::RCC::CFGR::get_RTCPRE(); }
    #endif
    static void set_config_RTC(uint32_t on, uint32_t value);
    static inline bool get_RTC_source() { return STM32_REGS::RCC::BDCR::get_flags<STM32_REGS::RCC::BDCR::EMasks::RTCSEL>(); }

#if defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) ||\
    defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F410Tx) || defined(STM32F410Cx) ||\
    defined(STM32F410Rx) || defined(STM32F411xE) || defined(STM32F446xx) || defined(STM32F469xx) ||\
    defined(STM32F479xx) || defined(STM32F412Zx) || defined(STM32F412Vx) || defined(STM32F412Rx) ||\
    defined(STM32F412Cx) || defined(STM32F413xx) || defined(STM32F423xx)
    static inline void set_TIM_prescaler(uint32_t val) { MODIFY_REG(RCC_->DCKCFGR, RCC_DCKCFGR_TIMPRE_Msk, val << RCC_DCKCFGR_TIMPRE_Pos); }
#endif

    static inline void force_reset_backup() { STM32_REGS::RCC::BDCR::set_flags<STM32_REGS::RCC::BDCR::EMasks::BDRST>(); }
    static inline void release_reset_backup() { STM32_REGS::RCC::BDCR::clear_flags<STM32_REGS::RCC::BDCR::EMasks::BDRST>(); }

    static inline void PLL_enable() { STM32_REGS::RCC::CR::set_flags<STM32_REGS::RCC::CR::EMasks::PLLON>(); }
    static inline void PLL_disable() { STM32_REGS::RCC::CR::clear_flags<STM32_REGS::RCC::CR::EMasks::PLLON>(); }
    static inline bool PLL_ready() { return STM32_REGS::RCC::CR::get_flags<STM32_REGS::RCC::CR::EMasks::PLLRDY>(); }
    #if defined(STM32F1)
    static inline void set_config_PLL_source(uint32_t value) { WRITE_REG(RCC_->CFGR, value); }
    static inline uint32_t get_source_PLL_OSC() { return RCC_->CFGR & RCC_CFGR_PLLSRC; }
    static inline void set_config_PLL_PLLM(uint32_t value) { MODIFY_REG(RCC_->CFGR, RCC_CFGR_PLLMULL, value); }
    #elif defined(STM32F4)
    static inline void set_config_PLL_source(uint32_t value) { STM32_REGS::RCC::PLLCFGR::set(value); }
    static inline bool get_source_PLL_OSC() { return STM32_REGS::RCC::PLLCFGR::get_flags<STM32_REGS::RCC::PLLCFGR::EMasks::PLLSRC_HSE>(); }
    #endif

    static inline void set_config_SYSCLK(ESystemClock value) { STM32_REGS::RCC::CFGR::set_SW(static_cast<uint32_t>(value)); }
    static inline ESystemClock get_source_SYSCLK() { return static_cast<ESystemClock>(STM32_REGS::RCC::CFGR::get_SWS()); }

    #if defined(STM32F1)
    static inline void set_config_MCO1(uint32_t source, uint32_t div)
        { MODIFY_REG(RCC_->CFGR, RCC_CFGR_MCO, (source | div)); }
    #else // STM32F1
    static inline void set_config_MCO1(EMCO1Source source, EMCODivider div)
        { STM32_REGS::RCC::CFGR::set_MCO1PRE(static_cast<uint32_t>(div));
          STM32_REGS::RCC::CFGR::set_MCO1(static_cast<uint32_t>(source)); }

    static inline void set_config_MCO2(EMCO2Source source, EMCODivider div)
        {  STM32_REGS::RCC::CFGR::set_MCO2PRE(static_cast<uint32_t>(div));
           STM32_REGS::RCC::CFGR::set_MCO2(static_cast<uint32_t>(source)); }
    #endif // STM32F1

    static inline void enable_IT(EIT value) { *(reinterpret_cast<__IO uint8_t*>(STM32::RCC_BASE + RCC_CIR_OFFSET + 1)) |= static_cast<uint8_t>(value); }
    static inline void disable_IT(EIT value) { *(reinterpret_cast<__IO uint8_t*>(STM32::RCC_BASE + RCC_CIR_OFFSET + 1)) &= ~static_cast<uint8_t>(value); }
    static inline void clear_IT(EIT value) { *(reinterpret_cast<__IO uint8_t*>(STM32::RCC_BASE + RCC_CIR_OFFSET + 2)) = static_cast<uint8_t>(value); }
    static inline bool get_IT(EIT value) { return (STM32_REGS::RCC::CIR::get() & static_cast<uint32_t>(value)) == static_cast<uint32_t>(value); }

