andreili/STM32FX_FM/inc/stm32_rcc.hpp
    static inline void clear_reset_flags() { STM32_REGS::RCC::CSR::set_flags<STM32_REGS::RCC::CSR::EMasks::RMVF>(); }

    static bool get_flag(EFlag value);

    static uint32_t config_osc();
    static uint32_t config_clock();
    
    static inline uint32_t get_HCLK_freq() { return m_system_core_clock; }
    static uint32_t get_PCLK1_freq();
    static uint32_t get_PCLK2_freq();

    static void config_MCO1(EMCO1Source source, EMCODivider div);
    #ifdef RCC_CFGR_MCO2
    static void config_MCO2(EMCO2Source source, EMCODivider div);
    #endif

    static inline void CSS_enable() { STM32_REGS::RCC::CR::set_flags<STM32_REGS::RCC::CR::EMasks::CSSON>(); }
    static inline void CSS_disable() { STM32_REGS::RCC::CR::clear_flags<STM32_REGS::RCC::CR::EMasks::CSSON>(); }

#if defined(STM32F1)
    CLK_ENDIS(AHB, DMA1)
    CLK_ENDIS(AHB, SRAM)
    CLK_ENDIS(AHB, FLITF)
    CLK_ENDIS(AHB, CRC)

    CLK_ENDIS(APB1, TIM2)
    CLK_ENDIS(APB1, TIM3)
    CLK_ENDIS(APB1, WWDG)
    CLK_ENDIS(APB1, USART2)
    CLK_ENDIS(APB1, I2C1)
    CLK_ENDIS(APB1, BKP)
    CLK_ENDIS(APB1, PWR)

    CLK_ENDIS(APB2, AFIO)
    CLK_ENDIS_EX(APB2, GPIOA, IOPA)
    CLK_ENDIS_EX(APB2, GPIOB, IOPB)
    CLK_ENDIS_EX(APB2, GPIOC, IOPC)
    CLK_ENDIS_EX(APB2, GPIOD, IOPD)
    CLK_ENDIS(APB2, ADC1)
    CLK_ENDIS(APB2, TIM1)
    CLK_ENDIS(APB2, SPI1)
    CLK_ENDIS(APB2, USART1)
#else // STM32F1
    static inline void enable_clk_GPIOA() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOAEN>(); }
    static inline void disable_clk_GPIOA() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOAEN>(); }
    static inline void enable_clk_GPIOB() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOBEN>(); }
    static inline void disable_clk_GPIOB() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOBEN>(); }
    static inline void enable_clk_GPIOC() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOCEN>(); }
    static inline void disable_clk_GPIOC() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOCEN>(); }
    static inline void enable_clk_GPIOD() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIODEN>(); }
    static inline void disable_clk_GPIOD() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIODEN>(); }
    static inline void enable_clk_GPIOE() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOEEN>(); }
    static inline void disable_clk_GPIOE() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOEEN>(); }
    static inline void enable_clk_GPIOF() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOFEN>(); }
    static inline void disable_clk_GPIOF() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOFEN>(); }
    static inline void enable_clk_GPIOG() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOGEN>(); }
    static inline void disable_clk_GPIOG() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOGEN>(); }
    static inline void enable_clk_GPIOH() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOHEN>(); }
    static inline void disable_clk_GPIOH() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOHEN>(); }
    static inline void enable_clk_GPIOI() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOIEN>(); }
    static inline void disable_clk_GPIOI() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::GPIOIEN>(); }
#ifdef RCC_AHB1ENR_GPIOJEN
    CLK_ENDIS(AHB1, GPIOJ)
#endif
#ifdef RCC_AHB1ENR_GPIOKEN
    CLK_ENDIS(AHB1, GPIOK)
#endif
    static inline void enable_clk_CRC() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::CRCEN>(); }
    static inline void disable_clk_CRC() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::CRCEN>(); }
    static inline void enable_clk_DMA1() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::DMA1EN>(); }
    static inline void disable_clk_DMA1() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::DMA1EN>(); }
    static inline void enable_clk_DMA2() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::DMA2EN>(); }
    static inline void disable_clk_DMA2() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::DMA2EN>(); }
    static inline void enable_clk_BKPSRAM() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::BKPSRAMEN>(); }
    static inline void disable_clk_BKPSRAM() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::BKPSRAMEN>(); }
    static inline void enable_clk_CCMDATARAM() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::CCMDATARAMEN>(); }
    static inline void disable_clk_CCMDATARAM() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::CCMDATARAMEN>(); }
    static inline void enable_clk_OTGHS() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::OTGHSEN>(); }
    static inline void disable_clk_OTGHS() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::OTGHSEN>(); }
    static inline void enable_clk_OTGHSULPI() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::OTGHSULPIEN>(); }
    static inline void disable_clk_OTGHSULPI() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::OTGHSULPIEN>(); }
#ifdef RCC_AHB1ENR_DMA2DEN
    static inline void enable_clk_DMA2D() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::DMA2DEN>(); }
    static inline void disable_clk_DMA2D() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::DMA2DEN>(); }
#endif

    static inline void enable_clk_DCMI() { STM32_REGS::RCC::AHB2ENR::set_flags<STM32_REGS::RCC::AHB2ENR::EMasks::DCMIEN>(); }
    static inline void disable_clk_DCMI() { STM32_REGS::RCC::AHB2ENR::clear_flags<STM32_REGS::RCC::AHB2ENR::EMasks::DCMIEN>(); }
    static inline void enable_clk_RNG() { STM32_REGS::RCC::AHB2ENR::set_flags<STM32_REGS::RCC::AHB2ENR::EMasks::RNGEN>(); }
    static inline void disable_clk_RNG() { STM32_REGS::RCC::AHB2ENR::clear_flags<STM32_REGS::RCC::AHB2ENR::EMasks::RNGEN>(); }
    static inline void enable_clk_OTGFS() { STM32_REGS::RCC::AHB2ENR::set_flags<STM32_REGS::RCC::AHB2ENR::EMasks::OTGFSEN>(); }
    static inline void disable_clk_OTGFS() { STM32_REGS::RCC::AHB2ENR::clear_flags<STM32_REGS::RCC::AHB2ENR::EMasks::OTGFSEN>(); }

