andreili/STM32FX_FM/inc/stm32_rcc.hpp
#ifdef STM32F4
    static inline void enable_clk_ETHMAC() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACEN>(); }
    static inline void disable_clk_ETHMAC() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACEN>(); }
    static inline void enable_clk_ETHMACTX() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACTXEN>(); }
    static inline void disable_clk_ETHMACTX() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACTXEN>(); }
    static inline void enable_clk_ETHMACRX() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACRXEN>(); }
    static inline void disable_clk_ETHMACRX() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACRXEN>(); }
    static inline void enable_clk_ETHMACPTP() { STM32_REGS::RCC::AHB1ENR::set_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACPTPEN>(); }
    static inline void disable_clk_ETHMACPTP() { STM32_REGS::RCC::AHB1ENR::clear_flags<STM32_REGS::RCC::AHB1ENR::EMasks::ETHMACPTPEN>(); }

    static inline void enable_clk_eth() { enable_clk_ETHMAC(); enable_clk_ETHMACTX(); enable_clk_ETHMACRX(); }
    static inline void disable_clk_eth() { disable_clk_ETHMAC(); disable_clk_ETHMACTX(); disable_clk_ETHMACRX(); }

    static inline void enable_clk_USB_FS() { enable_clk_OTGFS(); enable_clk_SYSCFG(); }
    static inline void disable_clk_USB_FS() { disable_clk_OTGFS(); }

    static inline void enable_clk_USB_HS() { enable_clk_OTGHS(); enable_clk_SYSCFG(); }
    static inline void disable_clk_USB_HS() { disable_clk_OTGHS(); }
#endif // STM32F4

#ifdef RCC_AHB3ENR_FMCEN
    CLK_ENDIS(AHB3, FMC)
#endif
#ifdef RCC_AHB3ENR_FSMCEN
    static inline void enable_clk_FSMC() { STM32_REGS::RCC::AHB3ENR::set_flags<STM32_REGS::RCC::AHB3ENR::EMasks::FSMCEN>(); }
    static inline void disable_clk_FSMC() { STM32_REGS::RCC::AHB3ENR::clear_flags<STM32_REGS::RCC::AHB3ENR::EMasks::FSMCEN>(); }
#endif
#ifdef RCC_AHB3ENR_QSPIEN
    CLK_ENDIS(AHB3, QSPI)
#endif
    static inline void enable_clk_TIM2() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM2EN>(); }
    static inline void disable_clk_TIM2() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM2EN>(); }
    static inline void enable_clk_TIM3() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM3EN>(); }
    static inline void disable_clk_TIM3() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM3EN>(); }
    static inline void enable_clk_TIM4() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM4EN>(); }
    static inline void disable_clk_TIM4() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM4EN>(); }
    static inline void enable_clk_TIM5() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM5EN>(); }
    static inline void disable_clk_TIM5() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM5EN>(); }
    static inline void enable_clk_TIM6() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM6EN>(); }
    static inline void disable_clk_TIM6() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM6EN>(); }
    static inline void enable_clk_TIM7() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM7EN>(); }
    static inline void disable_clk_TIM7() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM7EN>(); }
    static inline void enable_clk_TIM12() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM12EN>(); }
    static inline void disable_clk_TIM12() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM12EN>(); }
    static inline void enable_clk_TIM13() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM13EN>(); }
    static inline void disable_clk_TIM13() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM13EN>(); }
    static inline void enable_clk_TIM14() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM14EN>(); }
    static inline void disable_clk_TIM14() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::TIM14EN>(); }
    static inline void enable_clk_WWDG() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::WWDGEN>(); }
    static inline void disable_clk_WWDG() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::WWDGEN>(); }
    static inline void enable_clk_SPI2() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::SPI2EN>(); }
    static inline void disable_clk_SPI2() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::SPI2EN>(); }
    static inline void enable_clk_SPI3() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::SPI3EN>(); }
    static inline void disable_clk_SPI3() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::SPI3EN>(); }
    static inline void enable_clk_USART2() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::USART2EN>(); }
    static inline void disable_clk_USART2() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::USART2EN>(); }
    static inline void enable_clk_USART3() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::USART3EN>(); }
    static inline void disable_clk_USART3() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::USART3EN>(); }
    static inline void enable_clk_UART4() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART4EN>(); }
    static inline void disable_clk_UART4() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART4EN>(); }
    static inline void enable_clk_UART5() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART5EN>(); }
    static inline void disable_clk_UART5() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART5EN>(); }
    static inline void enable_clk_I2C1() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::I2C1EN>(); }
    static inline void disable_clk_I2C1() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::I2C1EN>(); }
    static inline void enable_clk_I2C2() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::I2C2EN>(); }
    static inline void disable_clk_I2C2() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::I2C2EN>(); }
    static inline void enable_clk_I2C3() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::I2C3EN>(); }
    static inline void disable_clk_I2C3() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::I2C3EN>(); }
    static inline void enable_clk_CAN1() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::CAN1EN>(); }
    static inline void disable_clk_CAN1() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::CAN1EN>(); }
    static inline void enable_clk_CAN2() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::CAN2EN>(); }
    static inline void disable_clk_CAN2() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::CAN2EN>(); }
    static inline void enable_clk_PWR() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::PWREN>(); }
    static inline void disable_clk_PWR() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::PWREN>(); }
    static inline void enable_clk_DAC() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::DACEN>(); }
    static inline void disable_clk_DAC() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::DACEN>(); }
#ifdef RCC_APB1ENR_UART7EN
    static inline void enable_clk_UART7() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART7EN>(); }
    static inline void disable_clk_UART7() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART7EN>(); }
#endif
#ifdef RCC_APB1ENR_UART9EN
    static inline void enable_clk_UART8() { STM32_REGS::RCC::APB1ENR::set_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART8EN>(); }
    static inline void disable_clk_UART8() { STM32_REGS::RCC::APB1ENR::clear_flags<STM32_REGS::RCC::APB1ENR::EMasks::UART8EN>(); }
#endif

    static inline void enable_clk_TIM1() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM1EN>(); }
    static inline void disable_clk_TIM1() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM1EN>(); }
    static inline void enable_clk_TIM8() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM8EN>(); }
    static inline void disable_clk_TIM8() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM8EN>(); }
    static inline void enable_clk_TIM9() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM9EN>(); }
    static inline void disable_clk_TIM9() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM9EN>(); }
    static inline void enable_clk_TIM10() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM10EN>(); }
    static inline void disable_clk_TIM10() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM10EN>(); }
    static inline void enable_clk_TIM11() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM11EN>(); }
    static inline void disable_clk_TIM11() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::TIM11EN>(); }
    static inline void enable_clk_USART1() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::USART1EN>(); }
    static inline void disable_clk_USART1() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::USART1EN>(); }
    static inline void enable_clk_USART6() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::USART6EN>(); }
    static inline void disable_clk_USART6() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::USART6EN>(); }
    static inline void enable_clk_ADC1() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::ADC1EN>(); }
    static inline void disable_clk_ADC1() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::ADC1EN>(); }
    static inline void enable_clk_ADC2() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::ADC2EN>(); }
    static inline void disable_clk_ADC2() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::ADC2EN>(); }
    static inline void enable_clk_ADC3() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::ADC3EN>(); }
    static inline void disable_clk_ADC3() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::ADC3EN>(); }
    static inline void enable_clk_SDIO() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SDIOEN>(); }
    static inline void disable_clk_SDIO() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SDIOEN>(); }
    static inline void enable_clk_SPI1() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI1EN>(); }
    static inline void disable_clk_SPI1() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI1EN>(); }
#ifdef RCC_APB2ENR_SPI4EN
    static inline void enable_clk_SPI4() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI4EN>(); }
    static inline void disable_clk_SPI4() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI4EN>(); }
#endif
    static inline void enable_clk_SYSCFG() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SYSCFGEN>(); }
    static inline void disable_clk_SYSCFG() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SYSCFGEN>(); }
#ifdef RCC_APB2ENR_LTDCEN
    static inline void enable_clk_LTDC() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::LTDCEN>(); }
    static inline void disable_clk_LTDC() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::LTDCEN>(); }
#endif
#ifdef RCC_APB2ENR_DSIEN
    static inline void enable_clk_DSI() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::DSIEN>(); }
    static inline void disable_clk_DSI() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::DSIEN>(); }
#endif
#ifdef RCC_APB2ENR_SPI5EN
    static inline void enable_clk_SPI5() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI5EN>(); }
    static inline void disable_clk_SPI5() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI5EN>(); }
#endif
#ifdef RCC_APB2ENR_SPI6EN
    static inline void enable_clk_SPI6() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI6EN>(); }
    static inline void disable_clk_SPI6() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SPI6EN>(); }
#endif
#ifdef RCC_APB2ENR_SAI1EN
    static inline void enable_clk_SAI1() { STM32_REGS::RCC::APB2ENR::set_flags<STM32_REGS::RCC::APB2ENR::EMasks::SAI1EN>(); }
    static inline void disable_clk_SAI1() { STM32_REGS::RCC::APB2ENR::clear_flags<STM32_REGS::RCC::APB2ENR::EMasks::SAI1EN>(); }
#endif
#endif // STM32F1

#if defined(STM32F1)
    static inline void APB1_reset_force() { STM32_REGS::RCC::APB1RSTR::set(0xFFFFFFFFU); }
    static inline void APB1_reset_release() { STM32_REGS::RCC::APB1RSTR::set(0); }
    template <STM32_REGS::RCC::APB1RSTR::EMasks ... flags>
    static inline void APB1_reset_force()
    {
        STM32_REGS::RCC::APB1RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB1RSTR::EMasks ... flags>
    static inline void APB1_reset_release()
    {
        STM32_REGS::RCC::APB1RSTR::clear_flags<flags ...>();
    }

    static inline void APB2_reset_force() { STM32_REGS::RCC::APB2RSTR::set(0xFFFFFFFFU); }
    static inline void APB2_reset_release() { STM32_REGS::RCC::APB2RSTR::set(0); }
    template <STM32_REGS::RCC::APB2RSTR::EMasks ... flags>
    static inline void APB2_reset_force()
    {
        STM32_REGS::RCC::APB2RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB2RSTR::EMasks ... flags>
    static inline void APB2_reset_release()
    {
        STM32_REGS::RCC::APB2RSTR::clear_flags<flags ...>();
    }
#else
    static inline void AHB1_reset_force() { STM32_REGS::RCC::AHB1RSTR::set(0xFFFFFFFFU); }
    static inline void AHB1_reset_release() { STM32_REGS::RCC::AHB1RSTR::set(0); }
    template <STM32_REGS::RCC::AHB1RSTR::EMasks ... flags>
    static inline void AHB1_reset_force()
    {
        STM32_REGS::RCC::AHB1RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB1RSTR::EMasks ... flags>
    static inline void AHB1_reset_release()
    {
        STM32_REGS::RCC::AHB1RSTR::clear_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB1LPENR::EMasks ... flags>
    static inline void AHB1_sleep_enable()
    {
        STM32_REGS::RCC::AHB1LPENR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB1LPENR::EMasks ... flags>
    static inline void AHB1_sleep_disable()
    {
        STM32_REGS::RCC::AHB1LPENR::clear_flags<flags ...>();
    }

    static inline void AHB2_reset_force() { STM32_REGS::RCC::AHB2RSTR::set(0xFFFFFFFFU); }
    static inline void AHB2_reset_release() { STM32_REGS::RCC::AHB2RSTR::set(0); }
    template <STM32_REGS::RCC::AHB2RSTR::EMasks ... flags>
    static inline void AHB2_reset_force()
    {
        STM32_REGS::RCC::AHB2RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB2RSTR::EMasks ... flags>
    static inline void AHB2_reset_release()
    {
        STM32_REGS::RCC::AHB2RSTR::clear_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB2LPENR::EMasks ... flags>
    static inline void AHB2_sleep_enable()
    {
        STM32_REGS::RCC::AHB2LPENR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB2LPENR::EMasks ... flags>
    static inline void AHB2_sleep_disable()
    {
        STM32_REGS::RCC::AHB2LPENR::clear_flags<flags ...>();
    }

    static inline void AHB3_reset_force() { STM32_REGS::RCC::AHB3RSTR::set(0xFFFFFFFFU); }
    static inline void AHB3_reset_release() { STM32_REGS::RCC::AHB3RSTR::set(0); }
    template <STM32_REGS::RCC::AHB3RSTR::EMasks ... flags>
    static inline void AHB3_reset_force()
    {
        STM32_REGS::RCC::AHB3RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB3RSTR::EMasks ... flags>
    static inline void AHB3_reset_release()
    {
        STM32_REGS::RCC::AHB3RSTR::clear_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB3LPENR::EMasks ... flags>
    static inline void AHB3_sleep_enable()
    {
        STM32_REGS::RCC::AHB3LPENR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::AHB3LPENR::EMasks ... flags>
    static inline void AHB3_sleep_disable()
    {
        STM32_REGS::RCC::AHB3LPENR::clear_flags<flags ...>();
    }

