andreili/STM32FX_FM/inc/stm32_rcc.hpp
    static inline void APB1_reset_force() { STM32_REGS::RCC::APB1RSTR::set(0xFFFFFFFFU); }
    static inline void APB1_reset_release() { STM32_REGS::RCC::APB1RSTR::set(0); }
    template <STM32_REGS::RCC::APB1RSTR::EMasks ... flags>
    static inline void APB1_reset_force()
    {
        STM32_REGS::RCC::APB1RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB1RSTR::EMasks ... flags>
    static inline void APB1_reset_release()
    {
        STM32_REGS::RCC::APB1RSTR::clear_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB1LPENR::EMasks ... flags>
    static inline void APB1_sleep_enable()
    {
        STM32_REGS::RCC::APB1LPENR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB1LPENR::EMasks ... flags>
    static inline void APB1_sleep_disable()
    {
        STM32_REGS::RCC::APB1LPENR::clear_flags<flags ...>();
    }

    static inline void APB2_reset_force() { STM32_REGS::RCC::APB2RSTR::set(0xFFFFFFFFU); }
    static inline void APB2_reset_release() { STM32_REGS::RCC::APB2RSTR::set(0); }
    template <STM32_REGS::RCC::APB2RSTR::EMasks ... flags>
    static inline void APB2_reset_force()
    {
        STM32_REGS::RCC::APB2RSTR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB2RSTR::EMasks ... flags>
    static inline void APB2_reset_release()
    {
        STM32_REGS::RCC::APB2RSTR::clear_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB2LPENR::EMasks ... flags>
    static inline void APB2_sleep_enable()
    {
        STM32_REGS::RCC::APB2LPENR::set_flags<flags ...>();
    }
    template <STM32_REGS::RCC::APB2LPENR::EMasks ... flags>
    static inline void APB2_sleep_disable()
    {
        STM32_REGS::RCC::APB2LPENR::clear_flags<flags ...>();
    }
#endif // STM32F1

    static void NMI_IRQ_Handler();

    #if defined(STM32F4)
    /* RCCex */
    static uint32_t periph_CLK_config(RCC_Periph_Clock_Source *sources);
    #endif

#if defined(STM32F429xx)
    ENDIS_REG_FLAG_NAME(PLLSAI_IT, RCC_->CIR, RCC_CIR_PLLSAIRDYIE)
    static inline void clear_PLLSAI_IT() { clear_IT(RCC_CIR_PLLSAIRDYF); }
    static bool get_PLLSAI_IT() { return get_IT(RCC_CIR_PLLSAIRDYIE); }
    static bool get_PLLSAI_flag() { return ((RCC_->CR & RCC_CR_PLLSAIRDY) == RCC_CR_PLLSAIRDY); }

    static inline void PLLI2S_SAI_config(uint32_t sn, uint32_t sq, uint32_t sr)
        { RCC_->PLLI2SCFGR = (sn << RCC_PLLI2SCFGR_PLLI2SN_Pos) |
                (sq << RCC_PLLI2SCFGR_PLLI2SQ_Pos) |
                (sr << RCC_PLLI2SCFGR_PLLI2SR_Pos); }
    static inline void PLLI2S_SAI_configQ(uint32_t sq)
        { MODIFY_REG(RCC_->DCKCFGR, RCC_DCKCFGR_PLLI2SDIVQ, sq); }

    static inline void PLLSAI_configQ(uint32_t sq)
        { MODIFY_REG(RCC_->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVQ, ((sq - 1) << 8)); }
    static inline void PLLSAI_configR(uint32_t sr)
        { MODIFY_REG(RCC_->DCKCFGR, RCC_DCKCFGR_PLLSAIDIVR, sr); }

    ENDIS_REG_FLAG(PLLSAI, RCC_->CR, RCC_CR_PLLSAION)
#endif
#ifdef STM32F4
    static inline void PLLI2S_enable() { STM32_REGS::RCC::CR::set_flags<STM32_REGS::RCC::CR::EMasks::PLLI2SON>(); }
    static inline void PLLI2S_disable() { STM32_REGS::RCC::CR::clear_flags<STM32_REGS::RCC::CR::EMasks::PLLI2SON>(); }
    static inline void PLLSAI_config(uint32_t sn, uint32_t sr)
        { STM32_REGS::RCC::PLLI2SCFGR::set_PLLI2SN(sn);
          STM32_REGS::RCC::PLLI2SCFGR::set_PLLI2SR(sr); }

    static inline void config_I2S(EI2SSource val)
    { if (val == EI2SSource::I2S_CKIN) STM32_REGS::RCC::CFGR::set_flags<STM32_REGS::RCC::CFGR::EMasks::I2SSRC>();
        else STM32_REGS::RCC::CFGR::clear_flags<STM32_REGS::RCC::CFGR::EMasks::I2SSRC>(); }
    static inline EI2SSource get_I2S_source() { return static_cast<EI2SSource>(STM32_REGS::RCC::CFGR::get_flags<STM32_REGS::RCC::CFGR::EMasks::I2SSRC>()); }
#endif // STM32F4

    static void update_clock();
private:
    static uint32_t m_system_core_clock;

    static uint32_t update_system_core_clock();
};

}

#endif
